# RbsFpSprinklerPressureClassParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsFpSprinklerPressureClassParam Property
ParameterTypeId Class See Also
---
"Pressure Class"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsFpSprinklerPressureClassParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsFpSprinklerPressureClassParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsFpSprinklerPressureClassParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace